In [1]:
import pandas as pd
t=pd.read_csv('titanic_cleaned.csv')
t.head(2)

   Unnamed: 0 Alive  Class  Gender   Age  Siblings  Parch   Price Emb Deck
0           2     1      3  female  26.0         0      0  $7.925   S  NaN
1           3     1      1  female  35.0         1      0   $53.1   S    C

In [2]:
t.info()#object exist in place of int or float

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 890 entries, 0 to 889
Data columns (total 10 columns):
Unnamed: 0    890 non-null int64
Alive         890 non-null object
Class         890 non-null int64
Gender        890 non-null object
Age           754 non-null object
Siblings      890 non-null int64
Parch         890 non-null int64
Price         890 non-null object
Emb           888 non-null object
Deck          202 non-null object
dtypes: int64(4), object(6)
memory usage: 48.7+ KB

In [4]:
t.describe()

       Unnamed: 0       Class    Siblings       Parch
count  890.000000  890.000000  890.000000  890.000000
mean   446.500000    2.308989    0.521348    0.382022
std    257.065167    0.835131    1.103270    0.806409
min      2.000000    1.000000    0.000000    0.000000
25%    224.250000    2.000000    0.000000    0.000000
50%    446.500000    3.000000    0.000000    0.000000
75%    668.750000    3.000000    1.000000    0.000000
max    891.000000    3.000000    8.000000    6.000000

In [5]:
(t.loc[::,['Class','Siblings','Price','Alive','Age']]).describe()

            Class    Siblings
count  890.000000  890.000000
mean     2.308989    0.521348
std      0.835131    1.103270
min      1.000000    0.000000
25%      2.000000    0.000000
50%      3.000000    0.000000
75%      3.000000    1.000000
max      3.000000    8.000000

In [6]:
t.Alive.unique()#here we have unique values of different dtypes

array(['1', '0', 'yes', 'no'], dtype=object)

In [7]:
t.Alive.value_counts()#we have yes amd no, instead of 1 and 0.
                    #hence it's suitable to stick to one parameter

0      548
1      340
yes      1
no       1
Name: Alive, dtype: int64

In [8]:
t.Alive.replace(to_replace=['yes','no'],value=[1,0],inplace=True)

In [9]:
t.Alive.value_counts()# Hence we changed yes and No to 1,0 using replce method
#but still data types remain deifferent

0    548
1    340
1      1
0      1
Name: Alive, dtype: int64

SyntaxError: invalid syntax (<ipython-input-11-a44d03811bad>, line 1)

,Year,City,Sport,Discipline,Athlete_name,Country,Gender,Event,Medal
0,1896,Athens,Aquatics,Swimming,"HAJOS, Alfred",HUN,Men,100M Freestyle,Gold Medal
1,1896,Athens,Aquatics,Swimming,"HERSCHMANN, Otto",AUT,Men,100M Freestyle,Silver

Gold          10483
Bronze        10372
Silver        10311
Gold Medal        4
Name: Medal, dtype: int64

Gold      10487
Bronze    10372
Silver    10311
Name: Medal, dtype: int64

'haider'

In [3]:
t.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 890 entries, 0 to 889
Data columns (total 10 columns):
Unnamed: 0    890 non-null int64
Alive         890 non-null object
Class         890 non-null int64
Gender        890 non-null object
Age           754 non-null object
Siblings      890 non-null int64
Parch         890 non-null int64
Price         890 non-null object
Emb           888 non-null object
Deck          202 non-null object
dtypes: int64(4), object(6)
memory usage: 48.7+ KB

In [4]:
# converting price to a numeric value from object
pd.to_numeric(t.Price)#We need to remove $ sign

ValueError: Unable to parse string

In [5]:
t.Price=(t.Price.str).replace('$','')

In [6]:
pd.to_numeric(t.Price)
t.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 890 entries, 0 to 889
Data columns (total 10 columns):
Unnamed: 0    890 non-null int64
Alive         890 non-null object
Class         890 non-null int64
Gender        890 non-null object
Age           754 non-null object
Siblings      890 non-null int64
Parch         890 non-null int64
Price         890 non-null object
Emb           888 non-null object
Deck          202 non-null object
dtypes: int64(4), object(6)
memory usage: 48.7+ KB

NameError: name 'olym' is not defined

In [23]:
olym.loc[olym.Athlete_name='HAJOS, ALFRED']
#Because unnecssary spaces exist

SyntaxError: invalid syntax (<ipython-input-23-90e995f64e46>, line 1)

'HAJOS, ALFRED'

In [25]:
# Changing Data Types

In [26]:
t.Price=pd.to_numeric(t.Price)#Changes dtype and saved to repective column
                                #as no  inplace paramter exists

In [27]:
t.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 890 entries, 0 to 889
Data columns (total 10 columns):
Unnamed: 0    890 non-null int64
Alive         890 non-null object
Class         890 non-null int64
Gender        890 non-null object
Age           754 non-null object
Siblings      890 non-null int64
Parch         890 non-null int64
Price         890 non-null float64
Emb           888 non-null object
Deck          202 non-null object
dtypes: float64(1), int64(4), object(5)
memory usage: 52.2+ KB

In [28]:
t.Price.astype('float').head(2)#Another method to do the same

0     7.925
1    53.100
Name: Price, dtype: float64

#Nan Values or missing values

In [30]:
sales

  Unnamed: 0  Mon  Tue  Wed   Thu  Fri
0     Steven   34   27   15   NaN   33
1       Mike   45    9   74  87.0   12
2       Andi   17   33   54   8.0   29
3       Paul   87   67   27  45.0    7

0     NaN
1    87.0
2     8.0
3    45.0
Name: Thu, dtype: float64

    Names  Mon  Tue  Wed   Thu   Fri
0  Steven   34   27   15   NaN   NaN
1    Mike   45    9   74  87.0  12.0
2    Andi   17   33   54   8.0  29.0
3    Paul   87   67   27  45.0   7.0

In [35]:
#Detecting missing Values

In [36]:
t.head(2)

   Unnamed: 0 Alive  Class  Gender   Age  Siblings  Parch   Price Emb Deck
0           2     1      3  female  26.0         0      0   7.925   S  NaN
1           3     1      1  female  35.0         1      0  53.100   S    C

In [37]:
t.info()# We can have a rough figure of Nan values from the following

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 890 entries, 0 to 889
Data columns (total 10 columns):
Unnamed: 0    890 non-null int64
Alive         890 non-null object
Class         890 non-null int64
Gender        890 non-null object
Age           754 non-null object
Siblings      890 non-null int64
Parch         890 non-null int64
Price         890 non-null float64
Emb           888 non-null object
Deck          202 non-null object
dtypes: float64(1), int64(4), object(5)
memory usage: 52.2+ KB

In [38]:
t.isna().sum(axis=0)#finding the number of na values

Unnamed: 0      0
Alive           0
Class           0
Gender          0
Age           136
Siblings        0
Parch           0
Price           0
Emb             2
Deck          688
dtype: int64

In [39]:
t.notna().sum(axis=0)#checkig hot notna/True values

Unnamed: 0    890
Alive         890
Class         890
Gender        890
Age           754
Siblings      890
Parch         890
Price         890
Emb           888
Deck          202
dtype: int64

In [40]:
t.isna().any(axis=0)

Unnamed: 0    False
Alive         False
Class         False
Gender        False
Age            True
Siblings      False
Parch         False
Price         False
Emb            True
Deck           True
dtype: bool

In [41]:
t.Age.value_counts(dropna=False).head(2)

NaN             136
Missing Data     41
Name: Age, dtype: int64

In [42]:
import numpy as np
#replacing missing values with na
t.replace(to_replace='Missing Data',value=np.nan,inplace=True)

In [43]:
t.info()#hence object type missing data eradicated

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 890 entries, 0 to 889
Data columns (total 10 columns):
Unnamed: 0    890 non-null int64
Alive         890 non-null object
Class         890 non-null int64
Gender        890 non-null object
Age           713 non-null object
Siblings      890 non-null int64
Parch         890 non-null int64
Price         890 non-null float64
Emb           888 non-null object
Deck          202 non-null object
dtypes: float64(1), int64(4), object(5)
memory usage: 52.2+ KB

Removing NA Values

In [57]:
t.drop(columns='Unnamed: 0',inplace=True)
t.head()

KeyError: "['Unnamed: 0'] not found in axis"

In [58]:
t.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 890 entries, 0 to 889
Data columns (total 9 columns):
Alive       890 non-null object
Class       890 non-null int64
Gender      890 non-null object
Age         713 non-null object
Siblings    890 non-null int64
Parch       890 non-null int64
Price       890 non-null float64
Emb         888 non-null object
Deck        202 non-null object
dtypes: float64(1), int64(3), object(5)
memory usage: 45.2+ KB

In [59]:
#we can either replace,remove(rows to columns) or maintain Na values
#solutions depend on the data set

In [60]:
t.loc[t.Emb.isna()]# hence we have two misssing values in Emb column
#Removing rows will affect other data

    Alive  Class  Gender   Age  Siblings  Parch  Price  Emb Deck
59      1      1  female  38.0         0      0   80.0  NaN    B
827     1      1  female  62.0         0      0   80.0  NaN    B

In [61]:
t.Age.value_counts(dropna=False).head(2)
#Hence 177 na value in age

NaN     177
24.0     31
Name: Age, dtype: int64

In [62]:
t.dropna(axis=0).shape#a dangerous move to remove every row with an na value

(181, 9)

In [63]:
t.dropna(axis=0,how='any').shape

(181, 9)

In [64]:
t.dropna(axis=1,how='any').shape#all rows with any missing value

(890, 6)

In [65]:
t.dropna(axis=1,how='all').shape#any column with all missing value

(890, 9)

In [66]:
t.dropna(axis=0,how='all').shape

(890, 9)

In [67]:
t.dropna(axis=0,thresh=8).shape#dropping all rows with atleast two missing values

(732, 9)

In [68]:
t.dropna(axis=1,thresh=500).shape#dropping dexk columns

(890, 8)

In [69]:
t.dropna(axis=0,subset=['Class','Alive','Age'],how='any').shape#dropping any row
#with missing value in the follwing

(713, 9)

In [70]:
t.dropna(axis=0,subset=['Class','Alive','Age'],thresh=3).shape#doing the  same with thresh

(713, 9)

,Year,City,Sport,Discipline,Athlete_name,Country,Gender,Event,Medal
29608,2012,London,Athletics,Athletics,PENDING,NaN,Women,1500M,Gold
31077,2012,London,Weightlifting,Weightlifting,PENDING,NaN,Women,63KG,Gold
31096,2012,London,Weightlifting,Weightlifting,PENDING,NaN,Men,94KG,Silver
31115,2012,London,Wrestling,Wrestling Freestyle,"KUDUKHOV, BESIK",NaN,Men,Wf 60 KG,Silver

Empty DataFrame
Columns: [Year, City, Sport, Discipline, Athlete_name, Country, Gender, Event, Medal]
Index: []

In [74]:
#filling is Missing Values

In [75]:
t.Age=pd.to_numeric(t.Age)
age_mean=round((t.Age).mean(),0)

In [76]:
t.Age.fillna(age_mean,inplace=True)#replcaing Values With mean
t.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 890 entries, 0 to 889
Data columns (total 9 columns):
Alive       890 non-null object
Class       890 non-null int64
Gender      890 non-null object
Age         890 non-null float64
Siblings    890 non-null int64
Parch       890 non-null int64
Price       890 non-null float64
Emb         888 non-null object
Deck        202 non-null object
dtypes: float64(2), int64(3), object(4)
memory usage: 48.7+ KB

In [77]:
#Duplicates
al= pd.DataFrame(["a", "b", "c", "c", "d", "e", "f", "g", "g", "g"], columns = ["Alphabet"])

In [78]:
al.duplicated(keep=False)

0    False
1    False
2     True
3     True
4    False
5    False
6    False
7     True
8     True
9     True
dtype: bool

In [79]:
al.duplicated(keep='first')

0    False
1    False
2    False
3     True
4    False
5    False
6    False
7    False
8     True
9     True
dtype: bool

In [80]:
al.loc[al.duplicated(keep=False)]

  Alphabet
2        c
3        c
7        g
8        g
9        g

In [81]:
t.duplicated(keep='first').sum()# count of duplicates

111

In [82]:
t.loc[t.duplicated(keep=False)].head()# Here all duplicated are present
#difficault to identif duplicated since  no key value present such Name or Idno.

   Alive  Class  Gender   Age  Siblings  Parch    Price Emb Deck
2      0      3    male  35.0         0      0   8.0500   S  NaN
15     1      2    male  31.0         0      0  13.0000   S  NaN
24     0      3    male  31.0         0      0   7.2250   C  NaN
26     1      3  female  31.0         0      0   7.8792   Q  NaN
27     0      3    male  31.0         0      0   7.8958   S  NaN

,Year,City,Sport,Discipline,Athlete_name,Country,Gender,Event,Medal
2068,1912,Stockholm,Athletics,Athletics,"LELONG, CHARLES LOUIS",FRA,Men,4X400M Relay,Silver
2069,1912,Stockholm,Athletics,Athletics,"LELONG, CHARLES LOUIS",FRA,Men,4X400M Relay,Silver
12252,1968,Mexico,Fencing,Fencing,"KALMAR, JANOS",HUN,Men,Sabre Team,Bronze
12253,1968,Mexico,Fencing,Fencing,"KALMAR, JANOS",HUN,Men,Sabre Team,Bronze
15595,1980,Moscow,Boxing,Boxing,"MUSTAFOV, ISMAIL",BUL,Men,- 48KG (Light-Flyweight),Bronze
15596,1980,Moscow,Boxing,Boxing,"MUSTAFOV, ISMAIL",BUL,Men,- 48KG (Light-Flyweight),Bronze
16101,1980,Moscow,Hockey,Hockey,"SINGH, SINGH",IND,Men,Hockey,Gold
16102,1980,Moscow,Hockey,Hockey,"SINGH, SINGH",IND,Men,Hockey,Gold
21832,1996,Atlanta,Baseball,Baseball,"SCULL, ANTONIO",CUB,Men,Baseball,Gold
21833,1996,Atlanta,Baseball,Baseball,"SCULL, ANTONIO",CUB,Men,Baseball,Gold
28677,2008,Beijing,Rowing,Rowing,"VOLPENHEIN, BRYAN",USA,Men,Eight With Coxswain (8+),Bronze
28678,2008,Beijing,Rowing,Rowing,"VOLPENHEIN, BRYAN",USA,Men,Eight With Coxswain (8+),Bronze
29784,2012,London,Badminton,Badminton,"ZHAO, YUNLEI",CHN,Women,Doubles,Gold
29790,2012,London,Badminton,Badminton,"ZHAO, YUNLEI",CHN,Women,Doubles,Gold

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 398 entries, 0 to 397
Data columns (total 9 columns):
mpg             398 non-null float64
cylinders       398 non-null int64
displacement    398 non-null float64
horsepower      392 non-null float64
weight          398 non-null int64
acceleration    398 non-null float64
model_year      398 non-null int64
origin          398 non-null object
name            398 non-null object
dtypes: float64(4), int64(3), object(2)
memory usage: 24.9+ KB

111

,Year,City,Sport,Discipline,Athlete Name,Country,Gender,Event,Medal
2068,1912,Stockholm,Athletics,Athletics,"LELONG, Charles Louis",FRA,Men,4X400M Relay,Silver
2069,1912,Stockholm,Athletics,Athletics,"LELONG, Charles Louis",FRA,Men,4X400M Relay,Silver
12252,1968,Mexico,Fencing,Fencing,"KALMAR, Janos",HUN,Men,Sabre Team,Bronze
12253,1968,Mexico,Fencing,Fencing,"KALMAR, Janos",HUN,Men,Sabre Team,Bronze
15595,1980,Moscow,Boxing,Boxing,"MUSTAFOV, Ismail",BUL,Men,- 48KG (Light-Flyweight),Bronze
15596,1980,Moscow,Boxing,Boxing,"MUSTAFOV, Ismail",BUL,Men,- 48KG (Light-Flyweight),Bronze
16101,1980,Moscow,Hockey,Hockey,"SINGH, Singh",IND,Men,Hockey,Gold
16102,1980,Moscow,Hockey,Hockey,"SINGH, Singh",IND,Men,Hockey,Gold
21832,1996,Atlanta,Baseball,Baseball,"SCULL, Antonio",CUB,Men,Baseball,Gold
21833,1996,Atlanta,Baseball,Baseball,"SCULL, Antonio",CUB,Men,Baseball,Gold
28677,2008,Beijing,Rowing,Rowing,"VOLPENHEIN, Bryan",USA,Men,Eight With Coxswain (8+),Bronze
28678,2008,Beijing,Rowing,Rowing,"VOLPENHEIN, Bryan",USA,Men,Eight With Coxswain (8+),Bronze
29784,2012,London,Badminton,Badminton,"ZHAO, Yunlei",CHN,Women,Doubles,Gold
29790,2012,London,Badminton,Badminton,"ZHAO, Yunlei",CHN,Women,Doubles,Gold

,Year,City,Sport,Discipline,Athlete Name,Country,Gender,Event,Medal
0,1896,Athens,Aquatics,Swimming,"HAJOS, Alfred",HUN,Men,100M Freestyle,Gold Medal
1,1896,Athens,Aquatics,Swimming,"HERSCHMANN, Otto",AUT,Men,100M Freestyle,Silver
2,1896,Athens,Aquatics,Swimming,"DRIVAS, Dimitrios",GRE,Men,100M Freestyle For Sailors,Bronze
3,1896,Athens,Aquatics,Swimming,"Malokinis, Ioannis",GRE,Men,100M Freestyle For Sailors,Gold Medal
4,1896,Athens,Aquatics,Swimming,"Chasapis, Spiridon",GRE,Men,100M Freestyle For Sailors,Silver
5,1896,Athens,Aquatics,Swimming,"Chorophas, Efstathios",GRE,Men,1200M Freestyle,Bronze
6,1896,Athens,Aquatics,Swimming,"Hajos, Alfred",HUN,Men,1200M Freestyle,Gold Medal
7,1896,Athens,Aquatics,Swimming,"Andreou, Joannis",GRE,Men,1200M Freestyle,Silver
8,1896,Athens,Aquatics,Swimming,"Chorophas, Efstathios",GRE,Men,400M Freestyle,Bronze
9,1896,Athens,Aquatics,Swimming,"Neumann, Paul",AUT,Men,400M Freestyle,Gold Medal
10,1896,Athens,Aquatics,Swimming,"Pepanos, Antonios",GRE,Men,400M Freestyle,Silver
11,1896,Athens,Athletics,Athletics,"Lane, Francis",USA,Men,100M,Bronze
12,1896,Athens,Athletics,Athletics,"Szokolyi, Alajos",HUN,Men,100M,Bronze
13,1896,Athens,Athletics,Athletics,"BURKE, Thomas",USA,Men,100M,Gold
14,1896,Athens,Athletics,Athletics,"HOFMANN, Fritz",GER,Men,100M,Silver
15,1896,Athens,Athletics,Athletics,"CURTIS, Thomas",USA,Men,110M Hurdles,Gold
16,1896,Athens,Athletics,Athletics,"GOULDING, Grantley",GBR,Men,110M Hurdles,Silver
17,1896,Athens,Athletics,Athletics,"LERMUSIAUX, Albin",FRA,Men,1500M,Bronze
18,1896,Athens,Athletics,Athletics,"FLACK, Edwin",AUS,Men,1500M,Gold
19,1896,Athens,Athletics,Athletics,"BLAKE, Arthur",USA,Men,1500M,Silver
20,1896,Athens,Athletics,Athletics,"GMELIN, Charles",GBR,Men,400M,Bronze
21,1896,Athens,Athletics,Athletics,"BURKE, Thomas",USA,Men,400M,Gold
22,1896,Athens,Athletics,Athletics,"JAMISON, Herbert",USA,Men,400M,Silver
23,1896,Athens,Athletics,Athletics,"GOLEMIS, Dimitrios",GRE,Men,800M,Bronze
24,1896,Athens,Athletics,Athletics,"FLACK, Edwin",AUS,Men,800M,Gold
25,1896,Athens,Athletics,Athletics,"DANI, Nandor",HUN,Men,800M,Silver
26,1896,Athens,Athletics,Athletics,"VERSIS, Sotirios",GRE,Men,Discus Throw,Bronze
27,1896,Athens,Athletics,Athletics,"GARRETT, Robert",USA,Men,Discus Throw,Gold
28,1896,Athens,Athletics,Athletics,"PARASKEVOPOULOS, Panagiotis",GRE,Men,Discus Throw,Silver
29,1896,Athens,Athletics,Athletics,"CLARK, Ellery",USA,Men,High Jump,Gold
...,...,...,...,...,...,...,...,...,...
31140,2012,London,Wrestling,Wrestling Freestyle,"GAZYUMOV, Khetag",AZE,Men,Wf 96 KG,Bronze
31141,2012,London,Wrestling,Wrestling Freestyle,"GOGSHELIDZE, George",GEO,Men,Wf 96 KG,Bronze
31142,2012,London,Wrestling,Wrestling Freestyle,"LOPEZ NUNEZ, Mijain",CUB,Men,Wg 120 KG,Gold
31143,2012,London,Wrestling,Wrestling Freestyle,"NABI, Heiki",EST,Men,Wg 120 KG,Silver
31144,2012,London,Wrestling,Wrestling Freestyle,"EUREN, Johan",SWE,Men,Wg 120 KG,Bronze
31145,2012,London,Wrestling,Wrestling Freestyle,"KAYAALP, Riza",TUR,Men,Wg 120 KG,Bronze
31146,2012,London,Wrestling,Wrestling Freestyle,"SORYAN REIHANPOUR, Hamid Mohammad",IRI,Men,Wg 55 KG,Gold
31147,2012,London,Wrestling,Wrestling Freestyle,"BAYRAMOV, Rovshan",AZE,Men,Wg 55 KG,Silver
31148,2012,London,Wrestling,Wrestling Freestyle,"MODOS, Peter",HUN,Men,Wg 55 KG,Bronze
31149,2012,London,Wrestling,Wrestling Freestyle,"SEMENOV, Mingiyan",RUS,Men,Wg 55 KG,Bronze
31150,2012,London,Wrestling,Wrestling Freestyle,"NOROOZI, Omid Haji",IRI,Men,Wg 60 KG,Gold
31151,2012,London,Wrestling,Wrestling Freestyle,"LASHKHI, Revaz",GEO,Men,Wg 60 KG,Silver
31152,2012,London,Wrestling,Wrestling Freestyle,"KURAMAGOMEDOV, Zaur",RUS,Men,Wg 60 KG,Bronze
31153,2012,London,Wrestling,Wrestling Freestyle,"MATSUMOTO, Ryutaro",JPN,Men,Wg 60 KG,Bronze
31154,2012,London,Wrestling,Wrestling Freestyle,"KIM, Hyeonwoo",KOR,Men,Wg 66 KG,Gold
31155,2012,London,Wrestling,Wrestling Freestyle,"LORINCZ, Tamas",HUN,Men,Wg 66 KG,Silver
31156,2012,London,Wrestling,Wrestling Freestyle,"GUENOT, Steeve",FRA,Men,Wg 66 KG,Bronze
31157,2012,London,Wrestling,Wrestling Freestyle,"TSKHADAIA, Manuchar",GEO,Men,Wg 66 KG,Bronze
31158,2012,London,Wrestling,Wrestling Freestyle,"VLASOV, Roman",RUS,Men,Wg 74 KG,Gold
31159,2012,London,Wrestling,Wrestling Freestyle,"JULFALAKYAN, Arsen",ARM,Men,Wg 74 KG,Silver
31160,2012,London,Wrestling,Wrestling Freestyle,"AHMADOV, Emin",AZE,Men,Wg 74 KG,Bronze
31161,2012,London,Wrestling,Wrestling Freestyle,"KAZAKEVIC, Aleksandr",LTU,Men,Wg 74 KG,Bronze
31162,2012,London,Wrestling,Wrestling Freestyle,"KHUGAEV, Alan",RUS,Men,Wg 84 KG,Gold
31163,2012,London,Wrestling,Wrestling Freestyle,"EBRAHIM, Karam Mohamed Gaber",EGY,Men,Wg 84 KG,Silver
31164,2012,London,Wrestling,Wrestling Freestyle,"GAJIYEV, Danyal",KAZ,Men,Wg 84 KG,Bronze
31165,2012,London,Wrestling,Wrestling Freestyle,"JANIKOWSKI, Damian",POL,Men,Wg 84 KG,Bronze
31166,2012,London,Wrestling,Wrestling Freestyle,"REZAEI, Ghasem Gholamreza",IRI,Men,Wg 96 KG,Gold
31167,2012,London,Wrestling,Wrestling Freestyle,"TOTROV, Rustam",RUS,Men,Wg 96 KG,Silver
31168,2012,London,Wrestling,Wrestling Freestyle,"ALEKSANYAN, Artur",ARM,Men,Wg 96 KG,Bronze
31169,2012,London,Wrestling,Wrestling Freestyle,"LIDBERG, Jimmy",SWE,Men,Wg 96 KG,Bronze

(31168, 9)

In [98]:
#Detecting incorrect outliers
t.describe()# Age and Fare column seem unreasonable

            Class         Age    Siblings       Parch       Price
count  890.000000  890.000000  890.000000  890.000000  890.000000
mean     2.308989   30.766483    0.521348    0.382022   32.163951
std      0.835131   21.599103    1.103270    0.806409   49.702360
min      1.000000    0.420000    0.000000    0.000000    0.000000
25%      2.000000   22.000000    0.000000    0.000000    7.925000
50%      3.000000   31.000000    0.000000    0.000000   14.454200
75%      3.000000   35.000000    1.000000    0.000000   31.000000
max      3.000000  490.000000    8.000000    6.000000  512.329200

In [99]:
t.Age.sort_values(ascending=False).head(4)

451    490.0
783    250.0
215    102.0
628     80.0
Name: Age, dtype: float64

In [100]:
t[t.Age>90]

    Alive  Class Gender    Age  Siblings  Parch    Price Emb Deck
215     0      2   male  102.0         1      0  27.0000   S  NaN
451     1      1   male  490.0         1      0  89.1042   C    C
783     0      3   male  250.0         0      0   7.2500   S  NaN

In [102]:
t.Price.sort_values(ascending=False).head()# hence is maybe correct and justified

677    512.3292
735    512.3292
256    512.3292
25     263.0000
436    263.0000
Name: Price, dtype: float64

In [103]:
import matplotlib as plt

In [104]:
t.plot(kind='line',figsize=(12,12))
plt.show

AttributeError: module 'matplotlib' has no attribute 'show'

possible outcomes to replace or outliers

In [105]:
t.loc[[451,783,215],'Age']=t.Age.sort_values(ascending=False).head(3)/10

In [151]:
t.Age.sort_values(ascending=False).head(3)# hence we shifted decimal point
#Or we can also replace it with mean,median or further research

628    80.0
849    74.0
94     71.0
Name: Age, dtype: float64

In [106]:
t.nunique()

Alive         4
Class         3
Gender        2
Age          89
Siblings      7
Parch         7
Price       247
Emb           3
Deck          7
dtype: int64

In [107]:
t.describe(include=['O'])

       Alive Gender  Emb Deck
count    890    890  888  202
unique     4      2    3    7
top        0   male    S    C
freq     548    577  644   58

In [108]:
#converting to Category, lesser and repitive values exist saves memory

In [166]:
t.Gender=t.Gender.astype('category')

In [111]:
t.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 890 entries, 0 to 889
Data columns (total 9 columns):
Alive       890 non-null object
Class       890 non-null int64
Gender      890 non-null object
Age         890 non-null float64
Siblings    890 non-null int64
Parch       890 non-null int64
Price       890 non-null float64
Emb         888 non-null object
Deck        202 non-null object
dtypes: float64(2), int64(3), object(4)
memory usage: 48.7+ KB